{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "bias": true, "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "batch_input_shape": [null, 80, 160, 3], "activity_regularizer": null, "activation": "linear", "nb_filter": 24, "nb_col": 5, "nb_row": 5, "name": "convolution2d_1", "input_dtype": "float32", "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_1", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_2", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 36, "nb_col": 5, "nb_row": 5, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_2", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_3", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 48, "nb_col": 5, "nb_row": 5, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "name": "maxpooling2d_3", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_4", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 64, "nb_col": 3, "nb_row": 3, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "name": "convolution2d_5", "b_regularizer": null, "border_mode": "valid", "dim_ordering": "tf", "W_regularizer": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "activation": "linear", "nb_filter": 96, "nb_col": 3, "nb_row": 3, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_1", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 100, "activation": "linear", "b_regularizer": null, "input_dim": 2304, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_1"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 50, "activation": "linear", "b_regularizer": null, "input_dim": 100, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_2"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 10, "activation": "linear", "b_regularizer": null, "input_dim": 50, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_4", "W_regularizer": null, "W_constraint": null, "activity_regularizer": null, "output_dim": 1, "activation": "linear", "b_regularizer": null, "input_dim": 10, "bias": true, "b_constraint": null, "init": "glorot_uniform"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_3"}}], "keras_version": "1.2.0"}