{"keras_version": "1.2.0", "config": [{"config": {"nb_row": 5, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_1", "activation": "linear", "input_dtype": "float32", "W_constraint": null, "bias": true, "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "b_regularizer": null, "nb_filter": 24, "nb_col": 5, "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_1", "beta_regularizer": null, "mode": 2, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_2", "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "nb_filter": 36, "nb_col": 5, "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_2", "beta_regularizer": null, "mode": 2, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"nb_row": 5, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_3", "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "nb_filter": 48, "nb_col": 5, "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_3", "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_3", "beta_regularizer": null, "mode": 2, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_4", "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "nb_filter": 64, "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_4", "beta_regularizer": null, "mode": 0, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"nb_row": 3, "trainable": true, "init": "glorot_uniform", "name": "convolution2d_5", "activation": "linear", "W_constraint": null, "bias": true, "b_constraint": null, "subsample": [1, 1], "W_regularizer": null, "b_regularizer": null, "nb_filter": 96, "nb_col": 3, "dim_ordering": "tf", "border_mode": "valid", "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_5", "beta_regularizer": null, "mode": 2, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_1", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 100, "input_dim": 2304, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_6", "beta_regularizer": null, "mode": 2, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_2", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 50, "input_dim": 100, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_7", "beta_regularizer": null, "mode": 2, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_2", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_3", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 10, "input_dim": 50, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "init": "glorot_uniform", "activation": "linear", "name": "dense_4", "W_constraint": null, "bias": true, "b_constraint": null, "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "input_dim": 10, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"momentum": 0.99, "trainable": true, "axis": 1, "name": "batchnormalization_8", "beta_regularizer": null, "mode": 2, "gamma_regularizer": null, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_3", "activation": "tanh"}, "class_name": "Activation"}], "class_name": "Sequential"}