{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 3], "bias": true, "W_regularizer": null, "nb_row": 5, "nb_filter": 24, "border_mode": "valid", "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "activity_regularizer": null, "dim_ordering": "tf", "b_regularizer": null, "input_dtype": "float32", "b_constraint": null, "activation": "linear", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_2", "nb_row": 5, "nb_filter": 36, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activation": "linear", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_3", "nb_row": 5, "nb_filter": 48, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "nb_col": 5, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activation": "linear", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3", "border_mode": "valid", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_4", "nb_row": 3, "nb_filter": 64, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activation": "linear", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"init": "glorot_uniform", "subsample": [1, 1], "bias": true, "name": "convolution2d_5", "nb_row": 3, "nb_filter": 96, "border_mode": "valid", "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "nb_col": 3, "dim_ordering": "tf", "b_regularizer": null, "b_constraint": null, "activation": "linear", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_1", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "input_dim": 2304, "b_regularizer": null, "b_constraint": null, "output_dim": 100, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_2", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "input_dim": 100, "b_regularizer": null, "b_constraint": null, "output_dim": 50, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "tanh"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_3", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "input_dim": 50, "b_regularizer": null, "b_constraint": null, "output_dim": 10, "activation": "linear"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "bias": true, "name": "dense_4", "W_constraint": null, "activity_regularizer": null, "W_regularizer": null, "trainable": true, "input_dim": 10, "b_regularizer": null, "b_constraint": null, "output_dim": 1, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}]}