{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_row": 5, "name": "convolution2d_1", "W_constraint": null, "border_mode": "valid", "b_regularizer": null, "init": "glorot_uniform", "trainable": true, "bias": true, "nb_col": 5, "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 80, 160, 3], "activation": "linear", "nb_filter": 24}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [1, 1]}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 36}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"nb_row": 5, "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "nb_col": 5, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 48}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_4", "W_constraint": null, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"nb_row": 3, "name": "convolution2d_5", "W_constraint": null, "b_constraint": null, "nb_col": 3, "init": "glorot_uniform", "trainable": true, "border_mode": "valid", "subsample": [1, 1], "activity_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null, "bias": true, "activation": "linear", "nb_filter": 96}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_5", "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_regularizer": null, "output_dim": 100, "activity_regularizer": null, "input_dim": 1344, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_regularizer": null, "output_dim": 50, "activity_regularizer": null, "input_dim": 100, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"name": "dense_3", "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_regularizer": null, "output_dim": 10, "activity_regularizer": null, "input_dim": 50, "bias": true, "b_regularizer": null, "b_constraint": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"name": "dense_4", "W_constraint": null, "init": "glorot_uniform", "activation": "linear", "trainable": true, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null, "input_dim": 10, "bias": true, "b_regularizer": null, "b_constraint": null}}]}