{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "input_dtype": "float32", "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 3], "nb_col": 5, "name": "convolution2d_1", "nb_filter": 24, "bias": true, "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_filter": 36, "nb_col": 5, "name": "convolution2d_2", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_filter": 48, "nb_col": 5, "name": "convolution2d_3", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 5, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "trainable": true, "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_filter": 64, "nb_col": 3, "name": "convolution2d_4", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "bias": true, "activation": "linear", "W_constraint": null, "trainable": true, "init": "glorot_uniform", "nb_filter": 96, "nb_col": 3, "name": "convolution2d_5", "activity_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "nb_row": 3, "dim_ordering": "tf", "W_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "name": "dense_1", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 2304, "output_dim": 100, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_1"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "name": "dense_2", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 100, "output_dim": 50, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_2"}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "name": "dense_3", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 50, "output_dim": 10, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "name": "dense_4", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 10, "output_dim": 1, "W_regularizer": null, "b_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_3"}}]}