{"config": [{"config": {"nb_col": 5, "bias": true, "input_dtype": "float32", "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_1", "subsample": [1, 1], "W_constraint": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "activation": "linear", "batch_input_shape": [null, 80, 160, 3], "activity_regularizer": null, "nb_filter": 24, "b_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_col": 5, "bias": true, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_2", "subsample": [1, 1], "W_constraint": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 36, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_col": 5, "bias": true, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_3", "subsample": [1, 1], "W_constraint": null, "nb_row": 5, "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 48, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_col": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_4", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 64, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"nb_col": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "border_mode": "valid", "name": "convolution2d_5", "subsample": [1, 1], "W_constraint": null, "nb_row": 3, "b_regularizer": null, "trainable": true, "activation": "linear", "dim_ordering": "tf", "b_constraint": null, "nb_filter": 96, "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 2304, "activity_regularizer": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 100, "activity_regularizer": null, "output_dim": 50}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "activation_2", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}, {"config": {"W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_3", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 50, "activity_regularizer": null, "output_dim": 10}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "bias": true, "b_constraint": null, "name": "dense_4", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activation": "linear", "input_dim": 10, "activity_regularizer": null, "output_dim": 1}, "class_name": "Dense"}, {"config": {"name": "activation_3", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.0"}