{"config": [{"config": {"b_constraint": null, "input_dtype": "float32", "name": "convolution2d_1", "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "border_mode": "valid", "batch_input_shape": [null, 80, 160, 3], "W_constraint": null, "nb_filter": 24, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "activation": "linear"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"strides": [2, 2], "pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "name": "convolution2d_2", "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "W_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 36, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "convolution2d_3", "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "W_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 48, "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 5, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "convolution2d_4", "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [2, 2], "trainable": true, "W_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "convolution2d_5", "dim_ordering": "tf", "b_regularizer": null, "bias": true, "subsample": [1, 1], "trainable": true, "W_regularizer": null, "activation": "linear", "W_constraint": null, "nb_filter": 96, "nb_col": 3, "activity_regularizer": null, "init": "glorot_uniform", "nb_row": 3, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "name": "dense_1", "activation": "linear", "input_dim": 576, "trainable": true, "W_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 100}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_6"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_2", "activation": "linear", "input_dim": 100, "trainable": true, "W_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 50}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_7"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_3", "activation": "linear", "input_dim": 50, "trainable": true, "W_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 10}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_8"}, "class_name": "ELU"}, {"config": {"b_constraint": null, "name": "dense_4", "activation": "linear", "input_dim": 10, "trainable": true, "W_regularizer": null, "W_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "output_dim": 1}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}