{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "activation": "linear", "nb_row": 5, "bias": true, "nb_col": 5, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_1", "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "border_mode": "valid", "W_constraint": null, "b_constraint": null, "input_dtype": "float32", "b_regularizer": null, "nb_filter": 24}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activation": "linear", "nb_row": 5, "bias": true, "nb_col": 5, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 36}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activation": "linear", "nb_row": 5, "bias": true, "nb_col": 5, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 48}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activation": "linear", "nb_row": 3, "bias": true, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 64}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "activation": "linear", "nb_row": 3, "bias": true, "nb_col": 3, "W_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "subsample": [1, 1], "dim_ordering": "tf", "activity_regularizer": null, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "b_regularizer": null, "nb_filter": 96}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": 2304, "b_regularizer": null, "output_dim": 100}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": 100, "b_regularizer": null, "output_dim": 50}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_2", "p": 0.5}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "tanh"}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "init": "glorot_uniform", "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": 50, "b_regularizer": null, "output_dim": 10}}, {"class_name": "Dense", "config": {"trainable": true, "activation": "linear", "bias": true, "b_constraint": null, "init": "glorot_uniform", "name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "W_constraint": null, "input_dim": 10, "b_regularizer": null, "output_dim": 1}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "tanh"}}]}