{"config": [{"config": {"W_regularizer": null, "nb_filter": 24, "batch_input_shape": [null, 80, 160, 3], "trainable": true, "bias": true, "name": "convolution2d_1", "input_dtype": "float32", "subsample": [1, 1], "activation": "linear", "W_constraint": null, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_1", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "nb_filter": 36, "trainable": true, "bias": true, "name": "convolution2d_2", "subsample": [1, 1], "activation": "linear", "W_constraint": null, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "nb_filter": 48, "trainable": true, "bias": true, "name": "convolution2d_3", "subsample": [1, 1], "activation": "linear", "W_constraint": null, "border_mode": "valid", "nb_row": 5, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "name": "maxpooling2d_3", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "nb_filter": 64, "trainable": true, "bias": true, "name": "convolution2d_4", "subsample": [1, 1], "activation": "linear", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"W_regularizer": null, "nb_filter": 96, "trainable": true, "bias": true, "name": "convolution2d_5", "subsample": [1, 1], "activation": "linear", "W_constraint": null, "border_mode": "valid", "nb_row": 3, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "trainable": true, "bias": true, "name": "dense_1", "output_dim": 100, "input_dim": 2304, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "bias": true, "name": "dense_2", "output_dim": 50, "input_dim": 100, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"b_regularizer": null, "trainable": true, "bias": true, "name": "dense_3", "output_dim": 10, "input_dim": 50, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"b_regularizer": null, "trainable": true, "bias": true, "name": "dense_4", "output_dim": 1, "input_dim": 10, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "activity_regularizer": null, "b_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "tanh"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}