{"config": [{"config": {"activity_regularizer": null, "input_dtype": "float32", "name": "convolution2d_1", "bias": true, "nb_filter": 24, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "b_regularizer": null, "nb_row": 5, "W_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "name": "convolution2d_2", "b_regularizer": null, "bias": true, "nb_filter": 36, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "trainable": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "name": "convolution2d_3", "b_regularizer": null, "bias": true, "nb_filter": 48, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 5, "W_regularizer": null, "trainable": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "name": "convolution2d_4", "b_regularizer": null, "bias": true, "nb_filter": 64, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "subsample": [2, 2], "nb_row": 3, "W_regularizer": null, "trainable": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "name": "convolution2d_5", "b_regularizer": null, "bias": true, "nb_filter": 96, "b_constraint": null, "init": "glorot_uniform", "W_constraint": null, "border_mode": "valid", "activation": "linear", "dim_ordering": "tf", "subsample": [1, 1], "nb_row": 3, "W_regularizer": null, "trainable": true, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"name": "elu_5", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "name": "dense_1", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 100, "trainable": true, "input_dim": 576, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "name": "dense_2", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 50, "trainable": true, "input_dim": 100, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"name": "elu_7", "alpha": 1.0, "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "name": "dense_3", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 10, "trainable": true, "input_dim": 50, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "name": "dense_4", "W_regularizer": null, "bias": true, "init": "glorot_uniform", "W_constraint": null, "activation": "linear", "b_constraint": null, "output_dim": 1, "trainable": true, "input_dim": 10, "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}