{"config": [{"config": {"border_mode": "valid", "nb_filter": 24, "nb_row": 5, "W_regularizer": null, "activation": "linear", "name": "convolution2d_1", "dim_ordering": "tf", "b_constraint": null, "input_dtype": "float32", "bias": true, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 3], "trainable": true, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_filter": 36, "nb_row": 5, "W_regularizer": null, "activation": "linear", "name": "convolution2d_2", "dim_ordering": "tf", "b_constraint": null, "bias": true, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_filter": 48, "nb_row": 5, "W_regularizer": null, "activation": "linear", "name": "convolution2d_3", "dim_ordering": "tf", "b_constraint": null, "bias": true, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_filter": 64, "nb_row": 3, "W_regularizer": null, "activation": "linear", "name": "convolution2d_4", "dim_ordering": "tf", "b_constraint": null, "bias": true, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_3", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"border_mode": "valid", "nb_filter": 96, "nb_row": 3, "W_regularizer": null, "activation": "linear", "name": "convolution2d_5", "dim_ordering": "tf", "b_constraint": null, "bias": true, "subsample": [1, 1], "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "trainable": true, "W_constraint": null, "nb_col": 3}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_4", "trainable": true, "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"output_dim": 100, "W_regularizer": null, "activation": "linear", "name": "dense_1", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 1344, "trainable": true, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 50, "W_regularizer": null, "activation": "linear", "name": "dense_2", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 100, "trainable": true, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 10, "W_regularizer": null, "activation": "linear", "name": "dense_3", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 50, "trainable": true, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 1, "W_regularizer": null, "activation": "linear", "name": "dense_4", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "input_dim": 10, "trainable": true, "init": "glorot_uniform", "W_constraint": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}