{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "batch_input_shape": [null, 80, 160, 3], "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "activation": "linear", "W_regularizer": null, "name": "convolution2d_1", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 24, "input_dtype": "float32", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "activation": "linear", "W_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 36, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 5, "init": "glorot_uniform", "nb_row": 5, "activation": "linear", "W_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 48, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_2", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "activation": "linear", "W_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 64, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_3", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"dim_ordering": "tf", "nb_col": 3, "init": "glorot_uniform", "nb_row": 3, "activation": "linear", "W_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "border_mode": "valid", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 96, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_4", "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "name": "dense_1", "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 1344, "output_dim": 100, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "name": "dense_2", "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 100, "output_dim": 50, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "name": "dense_3", "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 50, "output_dim": 10, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_8"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "activation": "linear", "bias": true, "W_regularizer": null, "name": "dense_4", "b_constraint": null, "b_regularizer": null, "trainable": true, "W_constraint": null, "input_dim": 10, "output_dim": 1, "activity_regularizer": null}}]}