{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_1", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true, "trainable": true, "nb_row": 5, "input_dtype": "float32", "init": "glorot_uniform", "nb_filter": 24, "subsample": [1, 1], "activity_regularizer": null, "nb_col": 5, "batch_input_shape": [null, 80, 160, 3]}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "name": "maxpooling2d_1", "dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_2", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 36, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_3", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true, "trainable": true, "nb_row": 5, "init": "glorot_uniform", "nb_filter": 48, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 5}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_4", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true, "trainable": true, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 64, "subsample": [2, 2], "activity_regularizer": null, "nb_col": 3}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"b_constraint": null, "name": "convolution2d_5", "b_regularizer": null, "dim_ordering": "tf", "W_regularizer": null, "activation": "linear", "border_mode": "valid", "W_constraint": null, "bias": true, "trainable": true, "nb_row": 3, "init": "glorot_uniform", "nb_filter": 96, "subsample": [1, 1], "activity_regularizer": null, "nb_col": 3}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.3, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_1", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 100, "activation": "linear", "input_dim": 576, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_6", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_2", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 50, "activation": "linear", "input_dim": 100, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "p": 0.3, "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_7", "alpha": 1.0, "trainable": true}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_3", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 10, "activation": "linear", "input_dim": 50, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"b_constraint": null, "name": "dense_4", "init": "glorot_uniform", "W_regularizer": null, "output_dim": 1, "activation": "linear", "input_dim": 10, "W_constraint": null, "bias": true, "trainable": true, "b_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "tanh", "name": "activation_1", "trainable": true}}]}