{"config": [{"config": {"b_constraint": null, "trainable": true, "nb_row": 5, "subsample": [1, 1], "input_dtype": "float32", "activation": "linear", "nb_filter": 24, "bias": true, "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_1", "nb_col": 5, "batch_input_shape": [null, 80, 160, 3], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "trainable": true, "name": "maxpooling2d_1", "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 5, "nb_col": 5, "activation": "linear", "nb_filter": 36, "bias": true, "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_2", "subsample": [2, 2], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 5, "nb_col": 5, "activation": "linear", "nb_filter": 48, "bias": true, "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_3", "subsample": [2, 2], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "nb_col": 3, "activation": "linear", "nb_filter": 64, "bias": true, "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_4", "subsample": [2, 2], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "nb_row": 3, "nb_col": 3, "activation": "linear", "nb_filter": 96, "bias": true, "W_constraint": null, "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "dim_ordering": "tf", "init": "glorot_uniform", "name": "convolution2d_5", "subsample": [1, 1], "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 576, "activation": "linear", "bias": true, "output_dim": 100, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 100, "activation": "linear", "bias": true, "output_dim": 50, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 50, "activation": "linear", "bias": true, "output_dim": 10, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"b_constraint": null, "trainable": true, "input_dim": 10, "activation": "linear", "bias": true, "output_dim": 1, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "tanh"}, "class_name": "Activation"}], "class_name": "Sequential", "keras_version": "1.2.0"}