{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_filter": 24, "init": "glorot_uniform", "nb_row": 5, "activation": "linear", "W_constraint": null, "trainable": true, "W_regularizer": null, "nb_col": 5, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "b_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 80, 160, 3], "border_mode": "valid", "input_dtype": "float32", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_filter": 36, "init": "glorot_uniform", "nb_row": 5, "activation": "linear", "W_constraint": null, "trainable": true, "W_regularizer": null, "nb_col": 5, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_filter": 48, "init": "glorot_uniform", "nb_row": 5, "activation": "linear", "W_constraint": null, "trainable": true, "W_regularizer": null, "nb_col": 5, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "border_mode": "valid", "trainable": true}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_filter": 64, "init": "glorot_uniform", "nb_row": 3, "activation": "linear", "W_constraint": null, "trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "nb_filter": 96, "init": "glorot_uniform", "nb_row": 3, "activation": "linear", "W_constraint": null, "trainable": true, "W_regularizer": null, "nb_col": 3, "subsample": [1, 1], "dim_ordering": "tf", "bias": true, "b_regularizer": null, "b_constraint": null, "border_mode": "valid", "activity_regularizer": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "output_dim": 100, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": 2304, "trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "output_dim": 50, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": 100, "trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "output_dim": 10, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": 50, "trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"name": "dense_4", "output_dim": 1, "init": "glorot_uniform", "activation": "linear", "W_constraint": null, "input_dim": 10, "trainable": true, "W_regularizer": null, "bias": true, "b_regularizer": null, "b_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "tanh", "trainable": true}}], "keras_version": "1.2.0"}