{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_col": 5, "nb_filter": 24, "border_mode": "valid", "init": "glorot_uniform", "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "nb_row": 5, "input_dtype": "float32", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_1", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "nb_col": 5, "nb_filter": 36, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "nb_row": 5, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_2", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_2", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "nb_col": 5, "nb_filter": 48, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "nb_row": 5, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "maxpooling2d_3", "trainable": true, "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_3", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "nb_col": 3, "nb_filter": 64, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "nb_row": 3, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_4", "trainable": true, "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "nb_col": 3, "nb_filter": 96, "border_mode": "valid", "activity_regularizer": null, "dim_ordering": "tf", "activation": "linear", "b_constraint": null, "nb_row": 3, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "subsample": [1, 1], "bias": true, "b_regularizer": null, "W_constraint": null}}, {"class_name": "ELU", "config": {"name": "elu_5", "trainable": true, "alpha": 1.0}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "name": "dense_1", "input_dim": 2304, "output_dim": 100, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "tanh", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "name": "dense_2", "input_dim": 100, "output_dim": 50, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "activation": "tanh", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.5, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "name": "dense_3", "input_dim": 50, "output_dim": 10, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Dense", "config": {"bias": true, "activation": "linear", "name": "dense_4", "input_dim": 10, "output_dim": 1, "b_constraint": null, "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "activation": "tanh", "trainable": true}}], "keras_version": "1.2.0"}