{"config": [{"config": {"init": "glorot_uniform", "nb_row": 5, "trainable": true, "nb_col": 5, "name": "convolution2d_1", "W_constraint": null, "nb_filter": 24, "b_regularizer": null, "activation": "linear", "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_constraint": null, "input_dtype": "float32", "border_mode": "valid", "batch_input_shape": [null, 80, 160, 3], "subsample": [1, 1], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "pool_size": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "trainable": true, "name": "convolution2d_2", "nb_col": 5, "W_constraint": null, "nb_filter": 36, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "linear", "subsample": [2, 2], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "nb_row": 5, "trainable": true, "name": "convolution2d_3", "nb_col": 5, "W_constraint": null, "nb_filter": 48, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "linear", "subsample": [2, 2], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "nb_row": 3, "trainable": true, "name": "convolution2d_4", "nb_col": 3, "W_constraint": null, "nb_filter": 64, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "linear", "subsample": [2, 2], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "nb_row": 3, "trainable": true, "name": "convolution2d_5", "nb_col": 3, "W_constraint": null, "nb_filter": 96, "b_regularizer": null, "dim_ordering": "tf", "bias": true, "activity_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "linear", "subsample": [1, 1], "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "name": "dense_1", "W_constraint": null, "b_regularizer": null, "input_dim": 576, "activity_regularizer": null, "b_constraint": null, "output_dim": 100, "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_2", "W_constraint": null, "b_regularizer": null, "input_dim": 100, "activity_regularizer": null, "b_constraint": null, "output_dim": 50, "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_3", "W_constraint": null, "b_regularizer": null, "input_dim": 50, "activity_regularizer": null, "b_constraint": null, "output_dim": 10, "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "name": "dense_4", "W_constraint": null, "b_regularizer": null, "input_dim": 10, "activity_regularizer": null, "b_constraint": null, "output_dim": 1, "bias": true, "W_regularizer": null, "trainable": true, "activation": "linear"}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}