{"keras_version": "1.2.0", "config": [{"config": {"dim_ordering": "tf", "activity_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_1", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 24, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "input_dtype": "float32", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_1", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "strides": [2, 2], "name": "maxpooling2d_1", "trainable": true, "pool_size": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_2", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 36, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_2", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_3", "nb_col": 5, "b_regularizer": null, "b_constraint": null, "nb_row": 5, "trainable": true, "nb_filter": 48, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_3", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [2, 2], "W_constraint": null, "name": "convolution2d_4", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "trainable": true, "nb_filter": 64, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "name": "elu_4", "trainable": true}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "activity_regularizer": null, "subsample": [1, 1], "W_constraint": null, "name": "convolution2d_5", "nb_col": 3, "b_regularizer": null, "b_constraint": null, "nb_row": 3, "trainable": true, "nb_filter": 96, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "bias": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "dropout_1", "trainable": true, "p": 0.2}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_5", "trainable": true}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_2", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "input_dim": 576, "bias": true, "W_constraint": null, "name": "dense_1", "output_dim": 100, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "name": "elu_6", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "input_dim": 100, "bias": true, "W_constraint": null, "name": "dense_2", "output_dim": 50, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "trainable": true, "p": 0.3}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "name": "elu_7", "trainable": true}, "class_name": "ELU"}, {"config": {"activity_regularizer": null, "input_dim": 50, "bias": true, "W_constraint": null, "name": "dense_3", "output_dim": 10, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "input_dim": 10, "bias": true, "W_constraint": null, "name": "dense_4", "output_dim": 1, "b_regularizer": null, "b_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "activation": "linear", "trainable": true}, "class_name": "Dense"}, {"config": {"activation": "tanh", "name": "activation_1", "trainable": true}, "class_name": "Activation"}], "class_name": "Sequential"}