{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "batch_input_shape": [null, 80, 160, 3], "name": "convolution2d_1", "input_dtype": "float32", "b_constraint": null, "subsample": [1, 1], "nb_filter": 24, "activity_regularizer": null, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "name": "convolution2d_2", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_filter": 36, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_2"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "name": "convolution2d_3", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_filter": 48, "dim_ordering": "tf", "trainable": true, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_3"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "name": "convolution2d_4", "activity_regularizer": null, "subsample": [2, 2], "b_constraint": null, "nb_filter": 64, "dim_ordering": "tf", "trainable": true, "nb_col": 3, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_4"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "bias": true, "name": "convolution2d_5", "activity_regularizer": null, "subsample": [1, 1], "b_constraint": null, "nb_filter": 96, "dim_ordering": "tf", "trainable": true, "nb_col": 3, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "name": "dense_1", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "output_dim": 100, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 576}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_6"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "name": "dense_2", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "output_dim": 50, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_3"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_7"}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "name": "dense_3", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "output_dim": 10, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 50}}, {"class_name": "Dense", "config": {"activation": "linear", "bias": true, "name": "dense_4", "activity_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "output_dim": 1, "W_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "input_dim": 10}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_8"}}]}