{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "trainable": true, "activation": "linear", "name": "convolution2d_1", "nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "subsample": [1, 1], "nb_filter": 24}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true, "strides": [1, 1], "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "name": "convolution2d_2", "nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "subsample": [1, 1], "nb_filter": 36}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "name": "convolution2d_3", "nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 5, "subsample": [1, 1], "nb_filter": 48}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "name": "convolution2d_4", "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 64}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_4", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "border_mode": "valid", "dim_ordering": "tf", "bias": true, "b_regularizer": null, "W_regularizer": null, "b_constraint": null, "trainable": true, "activation": "linear", "name": "convolution2d_5", "nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "nb_col": 3, "subsample": [1, 1], "nb_filter": 96}}, {"class_name": "MaxPooling2D", "config": {"border_mode": "valid", "name": "maxpooling2d_5", "dim_ordering": "tf", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": 1344, "name": "dense_1", "output_dim": 100, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": 100, "name": "dense_2", "output_dim": 50, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": 50, "name": "dense_3", "output_dim": 10, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activation": "linear", "bias": true, "W_regularizer": null, "b_constraint": null, "trainable": true, "input_dim": 10, "name": "dense_4", "output_dim": 1, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null}}]}