{"config": [{"config": {"input_dtype": "float32", "nb_col": 5, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "nb_row": 5, "batch_input_shape": [null, 80, 160, 3], "dim_ordering": "tf", "bias": true, "name": "convolution2d_1", "W_regularizer": null, "nb_filter": 24, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"nb_col": 5, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "bias": true, "name": "convolution2d_2", "W_regularizer": null, "nb_filter": 36, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 5, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "nb_row": 5, "dim_ordering": "tf", "bias": true, "name": "convolution2d_3", "W_regularizer": null, "nb_filter": 48, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 3, "subsample": [2, 2], "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "bias": true, "name": "convolution2d_4", "W_regularizer": null, "nb_filter": 64, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_col": 3, "subsample": [1, 1], "b_constraint": null, "W_constraint": null, "nb_row": 3, "dim_ordering": "tf", "bias": true, "name": "convolution2d_5", "W_regularizer": null, "nb_filter": 96, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "trainable": true, "activity_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.3}, "class_name": "Dropout"}, {"config": {"output_dim": 100, "input_dim": 576, "b_constraint": null, "W_constraint": null, "bias": true, "name": "dense_1", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "elu_6", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 50, "input_dim": 100, "b_constraint": null, "W_constraint": null, "bias": true, "name": "dense_2", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_3", "p": 0.3}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "elu_7", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"output_dim": 10, "input_dim": 50, "b_constraint": null, "W_constraint": null, "bias": true, "name": "dense_3", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"output_dim": 1, "input_dim": 10, "b_constraint": null, "W_constraint": null, "bias": true, "name": "dense_4", "W_regularizer": null, "init": "glorot_uniform", "b_regularizer": null, "trainable": true, "activity_regularizer": null, "activation": "linear"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "tanh"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}