{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "batch_input_shape": [null, 80, 160, 3], "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 24, "border_mode": "valid", "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 5, "subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_1", "input_dtype": "float32", "W_constraint": null, "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_1", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 5, "subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_2", "W_constraint": null, "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_2", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 5, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 5, "subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_3", "W_constraint": null, "activation": "linear"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2], "strides": [2, 2]}}, {"class_name": "ELU", "config": {"name": "elu_3", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_4", "W_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_4", "alpha": 1.0, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_col": 3, "dim_ordering": "tf", "init": "glorot_uniform", "b_regularizer": null, "nb_filter": 96, "border_mode": "valid", "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "nb_row": 3, "subsample": [1, 1], "activity_regularizer": null, "name": "convolution2d_5", "W_constraint": null, "activation": "linear"}}, {"class_name": "ELU", "config": {"name": "elu_5", "alpha": 1.0, "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "output_dim": 100, "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "name": "dense_1", "input_dim": 2304, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "output_dim": 50, "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "name": "dense_2", "input_dim": 100, "W_constraint": null, "activation": "linear"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "tanh"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "output_dim": 10, "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "name": "dense_3", "input_dim": 50, "W_constraint": null, "activation": "linear"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "b_regularizer": null, "output_dim": 1, "trainable": true, "b_constraint": null, "W_regularizer": null, "bias": true, "activity_regularizer": null, "name": "dense_4", "input_dim": 10, "W_constraint": null, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "tanh"}}]}