{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"activation": "linear", "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "name": "convolution2d_1", "border_mode": "valid", "nb_filter": 64, "subsample": [1, 1], "nb_row": 3, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.5}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Convolution2D", "config": {"activation": "linear", "b_constraint": null, "nb_col": 3, "activity_regularizer": null, "b_regularizer": null, "W_regularizer": null, "W_constraint": null, "batch_input_shape": [null, 80, 160, 3], "input_dtype": "float32", "init": "glorot_uniform", "trainable": true, "dim_ordering": "tf", "name": "convolution2d_2", "border_mode": "valid", "nb_filter": 128, "subsample": [1, 1], "nb_row": 3, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "name": "maxpooling2d_2", "pool_size": [4, 4], "trainable": true, "strides": [4, 4], "border_mode": "valid"}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"activation": "linear", "b_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 256, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "input_dim": 21888, "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 128, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "input_dim": 256, "W_constraint": null, "bias": true}}, {"class_name": "Dense", "config": {"activation": "linear", "b_constraint": null, "trainable": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 1, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "input_dim": 128, "W_constraint": null, "bias": true}}]}