{"config": [{"config": {"batch_input_shape": [null, 80, 160, 3], "dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "bias": true, "W_constraint": null, "W_regularizer": null, "name": "convolution2d_1", "activation": "linear", "b_regularizer": null, "trainable": true, "border_mode": "same", "activity_regularizer": null, "init": "glorot_uniform", "nb_filter": 24, "input_dtype": "float32", "subsample": [1, 1], "b_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "nb_filter": 36, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_2", "b_constraint": null, "subsample": [2, 2], "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "nb_col": 5, "nb_row": 5, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "nb_filter": 48, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_3", "b_constraint": null, "subsample": [2, 2], "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "nb_filter": 64, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_4", "b_constraint": null, "subsample": [1, 1], "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "bias": true, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "nb_filter": 96, "border_mode": "valid", "activity_regularizer": null, "init": "glorot_uniform", "name": "convolution2d_5", "b_constraint": null, "subsample": [1, 1], "trainable": true}, "class_name": "Convolution2D"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dropout_1", "p": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": 3744, "bias": true, "output_dim": 100, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_6", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"input_dim": 100, "bias": true, "output_dim": 50, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_2", "p": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_7", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"input_dim": 50, "bias": true, "output_dim": 10, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_8", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"input_dim": 10, "bias": true, "output_dim": 1, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "dense_4", "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.2.0"}