{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "nb_filter": 24, "batch_input_shape": [null, 80, 160, 3], "nb_col": 5, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_1", "nb_row": 5, "input_dtype": "float32", "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1"}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "nb_filter": 36, "nb_col": 5, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_2", "nb_row": 5, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "nb_filter": 48, "nb_col": 5, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_3", "nb_row": 5, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [2, 2], "nb_filter": 64, "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_4", "nb_row": 3, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Convolution2D", "config": {"trainable": true, "border_mode": "valid", "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "nb_filter": 96, "nb_col": 3, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "convolution2d_5", "nb_row": 3, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_5", "alpha": 1.0}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": 576, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "dense_1", "output_dim": 100, "activation": "linear"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_6", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": 100, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "dense_2", "output_dim": 50, "activation": "linear"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_7", "alpha": 1.0}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": 50, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "dense_3", "output_dim": 10, "activation": "linear"}}, {"class_name": "Dense", "config": {"trainable": true, "init": "glorot_uniform", "b_constraint": null, "input_dim": 10, "activity_regularizer": null, "W_constraint": null, "W_regularizer": null, "b_regularizer": null, "bias": true, "name": "dense_4", "output_dim": 1, "activation": "linear"}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "tanh"}}]}