{"config": [{"config": {"b_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_constraint": null, "name": "convolution2d_1", "input_dtype": "float32", "W_constraint": null, "bias": true, "activation": "linear", "nb_filter": 24, "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "nb_row": 5, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_1"}, "class_name": "MaxPooling2D"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_1", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_constraint": null, "name": "convolution2d_2", "nb_row": 5, "W_constraint": null, "nb_filter": 36, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_2"}, "class_name": "MaxPooling2D"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_2", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_constraint": null, "name": "convolution2d_3", "nb_row": 5, "W_constraint": null, "nb_filter": 48, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "nb_col": 5, "W_regularizer": null, "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_3"}, "class_name": "MaxPooling2D"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_3", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_constraint": null, "name": "convolution2d_4", "nb_row": 3, "W_constraint": null, "nb_filter": 64, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_4", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"b_regularizer": null, "init": "glorot_uniform", "subsample": [1, 1], "trainable": true, "b_constraint": null, "name": "convolution2d_5", "nb_row": 3, "W_constraint": null, "nb_filter": 96, "activation": "linear", "dim_ordering": "tf", "border_mode": "valid", "nb_col": 3, "W_regularizer": null, "bias": true, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_5", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 100, "b_constraint": null, "name": "dense_1", "input_dim": 2304, "W_constraint": null, "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_6", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 50, "b_constraint": null, "name": "dense_2", "input_dim": 100, "W_constraint": null, "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_7", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_2"}, "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 10, "b_constraint": null, "name": "dense_3", "input_dim": 50, "W_constraint": null, "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "b_regularizer": null, "init": "glorot_uniform", "output_dim": 1, "b_constraint": null, "name": "dense_4", "input_dim": 10, "W_constraint": null, "bias": true, "activation": "linear", "W_regularizer": null, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"epsilon": 0.001, "mode": 0, "momentum": 0.99, "beta_regularizer": null, "gamma_regularizer": null, "trainable": true, "name": "batchnormalization_8", "axis": -1}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "tanh", "name": "activation_3"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}