{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "input_dtype": "float32", "b_constraint": null, "nb_filter": 24, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "batch_input_shape": [null, 80, 160, 3], "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "convolution2d_1", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "name": "maxpooling2d_1", "border_mode": "valid"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_filter": 36, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "convolution2d_2", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_filter": 48, "nb_col": 5, "nb_row": 5, "border_mode": "valid", "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "convolution2d_3", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_filter": 64, "nb_col": 3, "nb_row": 3, "border_mode": "valid", "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "convolution2d_4", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "init": "glorot_uniform", "b_constraint": null, "nb_filter": 96, "nb_col": 3, "nb_row": 3, "border_mode": "valid", "bias": true, "b_regularizer": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "name": "convolution2d_5", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_5"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 576, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 100, "trainable": true, "activation": "linear", "name": "dense_1", "W_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 100, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 50, "trainable": true, "activation": "linear", "name": "dense_2", "W_regularizer": null}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.3, "name": "dropout_3"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_7"}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 50, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 10, "trainable": true, "activation": "linear", "name": "dense_3", "W_regularizer": null}}, {"class_name": "Dense", "config": {"W_constraint": null, "input_dim": 10, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "activity_regularizer": null, "output_dim": 1, "trainable": true, "activation": "linear", "name": "dense_4", "W_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "tanh", "name": "activation_1"}}]}