{"class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "nb_col": 5, "activity_regularizer": null, "init": "glorot_uniform", "input_dtype": "float32", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "nb_filter": 24, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "batch_input_shape": [null, 80, 160, 3], "nb_row": 5, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [1, 1], "name": "maxpooling2d_1", "dim_ordering": "tf", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 36, "name": "convolution2d_2", "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_row": 5, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_2", "dim_ordering": "tf", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 48, "name": "convolution2d_3", "nb_col": 5, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_row": 5, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 64, "name": "convolution2d_4", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_4", "dim_ordering": "tf", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 96, "name": "convolution2d_5", "nb_col": 3, "init": "glorot_uniform", "dim_ordering": "tf", "b_constraint": null, "subsample": [1, 1], "W_constraint": null, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "border_mode": "valid", "b_regularizer": null, "nb_row": 3, "bias": true}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2], "name": "maxpooling2d_5", "dim_ordering": "tf", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_5", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": 1344, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "output_dim": 100, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_6", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": 100, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "output_dim": 50, "bias": true}}, {"class_name": "Dropout", "config": {"p": 0.2, "name": "dropout_2", "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_7", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": 50, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "output_dim": 10, "bias": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_8", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "init": "glorot_uniform", "b_constraint": null, "W_constraint": null, "input_dim": 10, "activity_regularizer": null, "trainable": true, "activation": "linear", "W_regularizer": null, "b_regularizer": null, "output_dim": 1, "bias": true}}], "keras_version": "1.2.0"}