{"config": [{"config": {"nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "input_dtype": "float32", "nb_col": 5, "name": "convolution2d_1", "subsample": [1, 1], "trainable": true, "border_mode": "valid", "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 24, "batch_input_shape": [null, 80, 160, 3], "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "elu_1", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "name": "convolution2d_2", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 36, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_2", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "elu_2", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 5, "name": "convolution2d_3", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 48, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "pool_size": [2, 2], "strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_3", "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "elu_3", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_4", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 64, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "elu_4", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"nb_row": 3, "init": "glorot_uniform", "activity_regularizer": null, "subsample": [1, 1], "nb_col": 3, "name": "convolution2d_5", "trainable": true, "b_constraint": null, "dim_ordering": "tf", "W_constraint": null, "activation": "linear", "bias": true, "nb_filter": 96, "border_mode": "valid", "b_regularizer": null, "W_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "epsilon": 0.001, "axis": -1, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99, "name": "batchnormalization_1", "mode": 0}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "elu_5", "alpha": 1.0}, "class_name": "ELU"}, {"config": {"trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "output_dim": 100, "name": "dense_1", "trainable": true, "input_dim": 2304, "b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_1", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "output_dim": 50, "name": "dense_2", "trainable": true, "input_dim": 100, "b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "p": 0.5, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "activation_2", "activation": "tanh"}, "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "output_dim": 10, "name": "dense_3", "trainable": true, "input_dim": 50, "b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"init": "glorot_uniform", "output_dim": 1, "name": "dense_4", "trainable": true, "input_dim": 10, "b_constraint": null, "bias": true, "W_constraint": null, "activation": "linear", "b_regularizer": null, "activity_regularizer": null, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "activation_3", "activation": "tanh"}, "class_name": "Activation"}], "keras_version": "1.2.0", "class_name": "Sequential"}